Group By and Aggregate Function

In [39]:
'''
Aggregate Function 
-------------------
Mean ->Calculates average record
Max->Extracts maximum value from column
Sum->Calculates total value for column
Min->Extracts minimum value from column
Count->Count total number of record
'''

'\nAggregate Function \n-------------------\nMean ->Calculates average record\nMax->Extracts maximum value from column\nSum->Calculates total value for column\nMin->Extracts minimum value from column\nCount->Count total number of record\n'

In [41]:
import pandas as pd

In [43]:
df = pd.read_csv("Datas/Employees.csv")

In [45]:
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0

In [47]:
df.isnull().sum()

EMPLOYEE_ID        0
FIRST_NAME         0
LAST_NAME          0
EMAIL              0
PHONE_NUMBER       0
HIRE_DATE          0
JOB_ID             0
SALARY             0
COMMISSION_PCT    76
MANAGER_ID         1
DEPARTMENT_ID      1
dtype: int64

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     111 non-null    int64
 1   FIRST_NAME      111 non-null    object
 2   LAST_NAME       111 non-null    object
 3   EMAIL           111 non-null    object
 4   PHONE_NUMBER    111 non-null    object
 5   HIRE_DATE       111 non-null    object
 6   JOB_ID          111 non-null    object
 7   SALARY          111 non-null    int64
 8   COMMISSION_PCT  35 non-null     float64
 9   MANAGER_ID      110 non-null    float64
 10  DEPARTMENT_ID   110 non-null    float64
dtypes: float64(3), int64(2), object(6)
memory usage: 9.7+ KB

In [51]:
df.shape

(111, 11)

In [53]:
#KPI(Key Performance Indicatar)

In [55]:
#Find total average salary of employees
average_salary = df['SALARY'].mean()
print(f"{average_salary:.2f}")

6560.58

In [57]:
#Find total salary
total_salary = df['SALARY'].sum()
total_salary

728224

In [59]:
#Find maximum salary
Highest = df['SALARY'].max()
Highest

24000

In [61]:
#Find minimum salary
Lowest = df['SALARY'].min()
Lowest

2100

In [63]:
#Count 
count_salary = df['SALARY'].count()
count_salary

111

In [65]:
total_unique_salary = df['SALARY'].nunique()
total_unique_salary

58

In [67]:
job_count = df['JOB_ID'].nunique()
job_count

19

In [69]:
job_count = df['JOB_ID'].value_counts()
job_count

JOB_ID
SA_REP        30
SH_CLERK      20
ST_CLERK      20
SA_MAN         5
IT_PROG        5
FI_ACCOUNT     5
PU_CLERK       5
ST_MAN         5
AC_MGR         2
PR_REP         2
HR_REP         2
AC_ACCOUNT     2
AD_VP          2
AD_ASST        1
MK_MAN         1
MK_REP         1
PU_MAN         1
FI_MGR         1
AD_PRES        1
Name: count, dtype: int64

Group By

In [72]:
#Find total salary of employees by each department
total = df.groupby('DEPARTMENT_ID')['SALARY'].sum()

In [74]:
total

DEPARTMENT_ID
10.0       4400
20.0      19000
30.0      24900
40.0      13000
50.0     156400
60.0      28800
70.0      20000
80.0     304500
90.0      58000
100.0     51608
110.0     40616
Name: SALARY, dtype: int64

In [76]:
total = df.groupby('DEPARTMENT_ID')['SALARY'].sum().reset_index()
total

    DEPARTMENT_ID  SALARY
0            10.0    4400
1            20.0   19000
2            30.0   24900
3            40.0   13000
4            50.0  156400
5            60.0   28800
6            70.0   20000
7            80.0  304500
8            90.0   58000
9           100.0   51608
10          110.0   40616

In [78]:
total = df.groupby('DEPARTMENT_ID')['SALARY'].count().reset_index()
total

    DEPARTMENT_ID  SALARY
0            10.0       1
1            20.0       2
2            30.0       6
3            40.0       2
4            50.0      45
5            60.0       5
6            70.0       2
7            80.0      34
8            90.0       3
9           100.0       6
10          110.0       4

In [80]:
#Find total salary ,average salary,max salary and min salary by job id
report = df.groupby('JOB_ID').agg(
    Total_Salary = ('SALARY','sum'),
    Average_Salary = ('SALARY','mean'),
    max_salary = ('SALARY','max'),
    min_salary = ('SALARY','min')
)

In [82]:
report

            Total_Salary  Average_Salary  max_salary  min_salary
JOB_ID
AC_ACCOUNT         16600          8300.0        8300        8300
AC_MGR             24016         12008.0       12008       12008
AD_ASST             4400          4400.0        4400        4400
AD_PRES            24000         24000.0       24000       24000
AD_VP              34000         17000.0       17000       17000
FI_ACCOUNT         39600          7920.0        9000        6900
FI_MGR             12008         12008.0       12008       12008
HR_REP             13000          6500.0        6500        6500
IT_PROG            28800          5760.0        9000        4200
MK_MAN             13000         13000.0       13000       13000
MK_REP              6000          6000.0        6000        6000
PR_REP             20000         10000.0       10000       10000
PU_CLERK           13900          2780.0        3100        2500
PU_MAN             11000         11000.0       11000       11000
SA_MAN             61000         12200.0       14000       10500
SA_REP            250500          8350.0       11500        6100
SH_CLERK           64300          3215.0        4200        2500
ST_CLERK           55700          2785.0        3600        2100
ST_MAN             36400          7280.0        8200        5800

In [84]:
#Find total salary ,average salary,max salary and min salary by job id and get the index as numbers

report = df.groupby('JOB_ID').agg(
    Total_Salary = ('SALARY','sum'),
    Average_Salary = ('SALARY','mean'),
    max_salary = ('SALARY','max'),
    min_salary = ('SALARY','min')
).reset_index()

In [86]:
report

        JOB_ID  Total_Salary  Average_Salary  max_salary  min_salary
0   AC_ACCOUNT         16600          8300.0        8300        8300
1       AC_MGR         24016         12008.0       12008       12008
2      AD_ASST          4400          4400.0        4400        4400
3      AD_PRES         24000         24000.0       24000       24000
4        AD_VP         34000         17000.0       17000       17000
5   FI_ACCOUNT         39600          7920.0        9000        6900
6       FI_MGR         12008         12008.0       12008       12008
7       HR_REP         13000          6500.0        6500        6500
8      IT_PROG         28800          5760.0        9000        4200
9       MK_MAN         13000         13000.0       13000       13000
10      MK_REP          6000          6000.0        6000        6000
11      PR_REP         20000         10000.0       10000       10000
12    PU_CLERK         13900          2780.0        3100        2500
13      PU_MAN         11000         11000.0       11000       11000
14      SA_MAN         61000         12200.0       14000       10500
15      SA_REP        250500          8350.0       11500        6100
16    SH_CLERK         64300          3215.0        4200        2500
17    ST_CLERK         55700          2785.0        3600        2100
18      ST_MAN         36400          7280.0        8200        5800

In [88]:
#Find total number of pizza sold by pizza category
#Find total number of pizza sold by pizza size
#find total sales by each month
#Find total unit price,average unit price of pizza sales by pizza category

In [90]:
data = pd.read_csv("Datas/pizza_sales.csv")
data.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,1/1/2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,1/1/2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3,2,five_cheese_l,1,1/1/2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza
3,4,2,ital_supr_l,1,1/1/2015,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
4,5,2,mexicana_m,1,1/1/2015,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza

In [92]:
data.columns

Index(['pizza_id', 'order_id', 'pizza_name_id', 'quantity', 'order_date',
       'order_time', 'unit_price', 'total_price', 'pizza_size',
       'pizza_category', 'pizza_ingredients', 'pizza_name'],
      dtype='object')

In [94]:
#Find total number of pizza sold by pizza category
pizza_count = data.groupby('pizza_category')['order_id'].count().reset_index()
pizza_count

  pizza_category  order_id
0        Chicken     10815
1        Classic     14579
2        Supreme     11777
3         Veggie     11449

In [96]:
pizzasize_count = data.groupby('pizza_size')['order_id'].count()
pizzasize_count

pizza_size
L      18526
M      15385
S      14137
XL       544
XXL       28
Name: order_id, dtype: int64

In [98]:
#find total sales by each month
data['order_date']= pd.to_datetime(data['order_date'],format =  'mixed')
data['Month'] = data['order_date'].dt.month
data.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name,Month
0,1,1,hawaiian_m,1,2015-01-01,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza,1
1,2,2,classic_dlx_m,1,2015-01-01,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza,1
2,3,2,five_cheese_l,1,2015-01-01,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza,1
3,4,2,ital_supr_l,1,2015-01-01,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza,1
4,5,2,mexicana_m,1,2015-01-01,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,1

In [101]:
total_month = data.groupby('Month')['order_id'].count().reset_index
total_month

<bound method Series.reset_index of Month
1     4288
2     3821
3     4251
4     4182
5     4008
6     4044
7     4212
8     4141
9     3780
10    4045
11    4226
12    3622
Name: order_id, dtype: int64>

In [105]:
#Find total unit price,average unit price of pizza sales by pizza category
Details = data.groupby('pizza_category')(
    Total_unit_price = ('unit_price','sum')
    A
    
)